#include "stdafx.h"
#include "Car_Oreca07.h" 
#include "PageNum.h"


Car_Oreca07::Car_Oreca07() {
	//AE86の初期設定

	//トルク設定
    data = {
        {0, 14},
        {250, 29},
        {500, 47},
        {750, 64},
        {1000, 80},
        {1250, 88},
        {1500, 101},
        {1750, 114},
        {2000, 126},
        {2250, 142},
        {2500, 156},
        {2750, 170},
        {3000, 182},
        {3250, 193},
        {3500, 200},
        {3750, 206},
        {4000, 208},
        {4250, 207},
        {4500, 204},
        {4750, 200},
        {5000, 196},
        {5250, 193},
        {5500, 191},
        {5750, 188},
        {6000, 183},
        {6250, 181},
        {6500, 179},
        {6750, 176},
        {7000, 172},
        {7250, 170},
        {7500, 169},
        {7800, 165},
        {8050, 158},
        {8300, 147},
        {8550, 127},
        {8800, 109},
        {9050, 91},
        {9300, 70},
        {9550, 49},
        {9800, 29},
        {10050, 8},
        {10250, 0}
    };
    //速度伝達比設定
    GEAR_RATIOS = { 1.593, 1.231, 0.989, 0.831, 0.704, 0.606 };

    vehicle_info = {
    735.0,              //車重[kg]
    2.766,              //ホイールベース[m]
    0.331,              //重心の高さ[m]
    1.424,              //トレッド幅[m]
    0.080,              //重心から後輪までの長さ [m]
    0.085,              //重心から前輪までの長さ [m]
    0.331,              //タイヤの半径 [m]
    GEAR_RATIOS,        //ギア比
    5.1,                //デフ比(ファイナルギア)
    data,               //エンジンのトルク[N・m]
    0.1745,//(約10度に設定してあるが変更可)             //タイヤの最大舵角 [rad]
    4100,               //最大制動力[N]
    1.045,              //全高[m]
    1588,               //フロントバネレート[N/m]
    1456,               //リアバネレート[N/m]
    0.1,                //(仮の値)
    6,
    8200,
    1500
    };

	

	//最大ギア数設定
	MaxGear = 6;

	//シフトアップ時の回転数調整量設定
	SHIFT_UP_RPM_ADJUST = 2000.0f;

	//シフトダウン時の回転調整量設定
	SHIFT_DOWN_RPM_ADJUST = 2000.0f;

	//伝達効率の設定
    Transmission_Efficiency = 0.95f;

    //タイヤ空気圧
    AirPressure = 1.5f;

    //ファイナルギアの設定
    FinalGearRatio = 5.1f;

	//車重の設定
	mass = 735.0f;

	//タイヤの直径設定
	wheelRadius = 0.331f;

	IdolingRPM = 1500.0f;

	//車両モデル設定
	m_PlayerCarModel.Init("Assets/modelData/Car/LMP2.tkm");

	//車両データ設定
	m_NowCar = ORECA07;

	//各タイヤのローカル座標設定
	m_LeftFrontWheelLocalPosition = { -28.0f,10.0f,55.0f };		//左フロント
	m_RightFrontWheelLocalPosition = { 28.0f,10.0f,55.0f };		//右フロント
	m_LeftRearWheelLocalPosition = { -23.0f,5.0f,-73.0f };		//左リア
	m_RightRearWheelLocalPosition = { 23.0f,5.0f,-73.0f };		//右リア
}

Car_Oreca07::~Car_Oreca07() {

}